Дошкольное_учреждение83/src/AccumulationRegisters/удуТМЦ_НаСкладах/удуТМЦ_НаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуТМЦ_НаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.удуСклады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.удуНоменклатура</types>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КВД</name>
    <type>
      <types>EnumRef.удуКВД</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/AccumulationRegisters/удуМетодическиеМатериалыНаРуках/удуМетодическиеМатериалыНаРуках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>удуМетодическиеМатериалыНаРуках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УчетнаяЕдиница</name>
    <type>
      <types>CatalogRef.удуУчетныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>CatalogRef.удуИнвентарныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Читатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлановаяДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаВыдачи</name>
    <type>
      <types>CatalogRef.удуПричиныВыдачиМетодическихМатериалов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дошкольное_учреждение83/src/AccumulationRegisters/удуТМЦ_НаСкладах/Forms/ФормаДляВыдачиМетодическихМатериалов/Module.bsl
&НаСервере
Функция ПолучитьКоличествоНаРуках(УчетнаяЕдиница, ИнвентарныйНомер)
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	удуМетодическиеМатериалыНаРукахОстатки.УчетнаяЕдиница,
			|	удуМетодическиеМатериалыНаРукахОстатки.ИнвентарныйНомер,
			|	СУММА(удуМетодическиеМатериалыНаРукахОстатки.КоличествоОстаток) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.удуМетодическиеМатериалыНаРуках.Остатки КАК удуМетодическиеМатериалыНаРукахОстатки
			|ГДЕ
			|	удуМетодическиеМатериалыНаРукахОстатки.УчетнаяЕдиница = &УчетнаяЕдиница
			|	И удуМетодическиеМатериалыНаРукахОстатки.ИнвентарныйНомер = &ИнвентарныйНомер
			|
			|СГРУППИРОВАТЬ ПО
			|	удуМетодическиеМатериалыНаРукахОстатки.УчетнаяЕдиница,
			|	удуМетодическиеМатериалыНаРукахОстатки.ИнвентарныйНомер");
			
		Запрос.Параметры.Вставить("УчетнаяЕдиница", УчетнаяЕдиница);
		Запрос.Параметры.Вставить("ИнвентарныйНомер", ИнвентарныйНомер);
			
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда			
			Возврат Выборка.Количество();
		Иначе 			
			Возврат 0;						
		КонецЕсли;
КонецФункции
	

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Результат = Новый Структура("Номенклатура,ИнвентарныйНомер,ДоступноеКоличество", ТекущиеДанные.Номенклатура, ТекущиеДанные.ИнвентарныйНомер, ТекущиеДанные.КоличествоОстаток);
		
		// Проверить наличие на полке
		КоличествоНаРуках = ПолучитьКоличествоНаРуках(ТекущиеДанные.Номенклатура, ТекущиеДанные.ИнвентарныйНомер);
		Результат.ДоступноеКоличество = Результат.ДоступноеКоличество - КоличествоНаРуках;
		
		Если Результат.ДоступноеКоличество < 1 Тогда
			Вопрос("Все экземпляры выбранного методического материала находятся на руках.", РежимДиалогаВопрос.ОК);
			Возврат;
		КонецЕсли; 	
		
		Закрыть(Результат);

КонецПроцедуры

// Отбор по наименованию
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ПараметрыОтбора)
	
	ЭлементыОтбора = Список.Отбор.Элементы;
	
	// наименование
	Если Не ЗначениеЗаполнено(ПараметрыОтбора["УчетнаяЕдиница"]) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьОтборУСписка(Список.Отбор,
			Новый ПолеКомпоновкиДанных("УчетнаяЕдиница.Наименование"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьОтборУСпискаНаСодержит(
			Список.Отбор,
			Новый ПолеКомпоновкиДанных("УчетнаяЕдиница.Наименование"),
			ПараметрыОтбора["УчетнаяЕдиница"]);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	
	ПараметрыОтбора = Новый Соответствие();
	Параметрыотбора.Вставить("УчетнаяЕдиница",ОтборНаименование);
	УстановитьОтборСписка(Список, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНаименованиеПриИзменении(Элемент)
	
	УстановитьОтбор();
	
КонецПроцедуры
